// Фіктивний список характеристик
const professions = [
  "Лікар-хірург",
  "Інженер-механік",
  "Вчитель фізкультури",
  "Архітектор",
  "Кухар",
  "Пілот",
  "Художник",
  "Програміст",
  "Медсестра",
  "Фермер",
  "Психолог",
  "Бізнесмен",
  "Пожежник",
  "Астронавт",
  "Дизайнер",
  "Юрист",
  "Музикант",
  "Фотограф",
  "Офіціант",
  "Будівельник",
  "Клоун",
  "Актор",
];
const healths = [
  "Ідеальне здоров'я",
  "Пневмонія",
  "Алкоголізм",
  "ВІЛ",
  "Вітрянка",
  "Амнезія",
  "Грип",
  "Застуда",
  "Мігрень",
  "Алергія на пил",
  "Немає лівої ноги",
  "Немає двох пальців на лівій руці",
  "Депресія",
  "Синдром Туретта",
  "Ідеальне здоров'я",
  "Астма",
  "Цукровий діабет 1-го типу",
  "Гіпертонія",
  "Гастрит",
  "Карлик",
  "Грибок нігтів",
];
const genders = ["Чоловік", "Жінка"];
const hobbies = [
  "Малювання",
  "Фотографування",
  "Подорожі",
  "Спорт",
  "Грання на фортепіано",
  "Готування",
  "Гірські походи",
  "Велоспорт",
  "Читання книг",
  "Настільні ігри",
  "Танці",
  "Риболовля",
  "Виноробство",
  "Театр",
  "Волонтерство",
  "Пошиття",
  "Плавання",
  "Колекціонування марок",
  "Астрономія",
  "Громадська робота",
  "Колекціонування жуків",
];
const facts = [
  "Пограбував власного дідуся",
  "Був у комі 4 роки",
  "Може дотягнутися язиком до ліктя",
  "Знає 5 мов",
  "Залишався на другий рік в школі",
  "Вегетаріанець",
  "Має власний гараж із колекцією ретро-автомобілів",
  "Має дві вищі освіти",
  "Грає у водне поло",
  "Співає в метро",
  "Не має передніх зубів",
  "Палить цигарки",
  "Має чотирьох дітей",
  "Вірить у всесвітню змову",
  "Проходив курс воєнної підготовки",
  "Пройшов похід 100 км",
  "Отримав у спадок 1 мільйон доларів",
  "Вміє грати на гітарі",
  "Успішний блогер в Інстаграм",
  "Читає сто книжок на рік",
  'Знає "Кобзаря" напам\'ять',
  "Знається на народній медицині",
];
const actioncards = [
  "У цьому раунді ти не голосуєш, але голоси проти вибраного учасника подвоюються",
  "Цього раунду проти тебе не можуть голосувати",
  "Ти можеш обмінятися багажем з однією людиною",
  "Ти можеш обмінятися здров'ям з однією людиною",
  "Ти можеш обмінятися професією з однією людиною",
  "Ти можеш обмінятися хобі з однією людиною",
  "Омолоди вибраного гравця на 15 років, якщо йому 33 і більше років (стаж віднімається також)",
  "Дістань нову характеристику здоров'я з колоди для вибраного гравця",
  "Дістань нову характеристику професії з колоди для вибраного гравця",
  "Дістань нову характеристику хобі з колоди для вибраного гравця",
  "Дістань нову характеристику факту з колоди для вибраного гравця",
];
const phobias = [
  "Клаустрофобія (страх перед замкненим простором)",
  "Агорафобія (страх перед відкритим простором)",
  "Гемофобія (страх крові)",
  "Арахнофобія (страх павуків)",
  "Ніктофобія (страх темряви, ночі)",
  "Талассофобія (страх морських подорожей, моря)",
  "Урофобія (страх захотіти в туалет в умовах, коли зробити це неможливо)",
  "Кінофобія (страх собак)",
  "Пеладофобія (страх лисих людей)",
  "Аквафобія (страх води)",
  "Арахнофобія (страх павуків)",
  "Авіафобія (страх польоту або літаків)",
  "Гідрофобія (страх води)",
  "Офідофобія (страх змій)",
  "Гермофобія (страх бруду або мікробів)",
  "Акрофобія (страх висоти)",
  "Некрофобія (страх смерті або трупів)",
  "Еметофобія (страх блювання)",
  "Ентомофобія (страх комах)",
  "Клауновідна фобія (страх клоунів)",
  "Термофобія (страх тепла або жару)",
  "Технофобія (страх технологій)",
  "Колібрифобія (страх колібрі)",
];
const conditions = [""];

// Функція для генерації випадкового елемента з масиву
function getRandomElement(array) {
  const randomIndex = Math.floor(Math.random() * array.length);
  return array[randomIndex];
}

// Функція для генерації картки гравця
function generateCharacter() {
  const profession = getRandomElement(professions);
  const gender = getRandomElement(genders);
  const age = Math.floor(Math.random() * 30) + 20; // Вік від 20 до 50 років
  const experience = Math.floor(Math.random() * (age - 18 + 1)); // Стаж від нуля до різниці віку та вісімнадцяти
  const health = getRandomElement(healths);
  const phobia = getRandomElement(phobias);
  const hobby = getRandomElement(hobbies);
  const fact = getRandomElement(facts);
  const condition = getRandomElement(conditions);

  const actionCard1 = [getRandomElement(actioncards)];

  let actionCard2;
  do {
    actionCard2 = getRandomElement(actioncards);
  } while (actionCard2 == actionCard1);

  const characterCard = `
        <h2>Характеристики гравця</h2>
        <p><strong>Професія та стаж:</strong> ${profession}, ${experience} років</p>
        <p><strong>Стать:</strong> ${gender}</p>
        <p><strong>Вік:</strong> ${age}</p>
        <p><strong>Стан Здоров'я:</strong> ${health}</p>
        <p><strong>Фобія:</strong> ${phobia}</p>
        <p><strong>Хобі:</strong> ${hobby}</p>
        <p><strong>Факт:</strong> ${fact}</p>
        <p><strong>Картки дії:</strong></p>
        <ul>
            <li>${actionCard1}</li>
            <li>${actionCard2}</li>
        </ul>
    `;

  document.getElementById("characterCard").innerHTML = characterCard;
}
